app/commands/create_account_command.rb

INSERT INTO "bank_accounts" ("account_id", "balance", "holder", "status", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?) RETURNING "id"  [["account_id", 1], ["balance", 0.0], ["holder", nil], ["status", nil], ["created_at", "2024-12-02 14:55:42.146427"], ["updated_at", "2024-12-02 14:55:42.146427"]]
INSERT INTO "events" ("entity_id", "event_type", "data", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?) RETURNING "id"  [["entity_id", 1], ["event_type", "account_created"], ["data", "{}"], ["created_at", "2024-12-02 15:02:46.449011"], ["updated_at", "2024-12-02 15:02:46.449011"]]
INSERT INTO "bank_accounts" ("account_id", "balance", "holder", "status", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?) RETURNING "id"  [["account_id", 1], ["balance", 0.0], ["holder", nil], ["status", nil], ["created_at", "2024-12-02 15:02:46.452957"], ["updated_at", "2024-12-02 15:02:46.452957"]]
---
  def execute
    Event.create!(entity_id: @account_id, event_type: 'account_created', data: {})
    Read::BankAccount.create!(account_id: @account_id, balance: 0)