app/commands/deposit_money_command.rb

  def execute
    Event.create!(entity_id: @account_id, event_type: 'money_deposited', data: { amount: @amount })
    account = Read::BankAccount.find_by(account_id: @account_id)
    account.update!(balance: account.balance + @amount)

    Read::Transaction.create!(account_id: @account_id, transaction_type: 'deposit', amount: @amount)
---
INSERT INTO "events" ("entity_id", "event_type", "data", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?) RETURNING "id"  [["entity_id", nil], ["event_type", "money_deposited"], ["data", "{\"amount\":3000.0}"], ["created_at", "2024-12-02 14:58:45.432929"], ["updated_at", "2024-12-02 14:58:45.432929"]]
SELECT "bank_accounts".* FROM "bank_accounts" WHERE "bank_accounts"."account_id" = ? LIMIT ?  [["account_id", nil], ["LIMIT", 1]]
UPDATE "bank_accounts" SET "balance" = ?, "updated_at" = ? WHERE "bank_accounts"."id" = ?  [["balance", 3000.0], ["updated_at", "2024-12-02 15:02:11.067941"], ["id", 1]]
INSERT INTO "transactions" ("account_id", "transaction_type", "amount", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?) RETURNING "id"  [["account_id", 1], ["transaction_type", "deposit"], ["amount", 3000.0], ["created_at", "2024-12-02 15:02:11.082382"], ["updated_at", "2024-12-02 15:02:11.082382"]]