app/commands/withdraw_money_command.rb

SELECT "bank_accounts".* FROM "bank_accounts" WHERE "bank_accounts"."account_id" = ? LIMIT ?  [["account_id", 1], ["LIMIT", 1]]
INSERT INTO "events" ("entity_id", "event_type", "data", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?) RETURNING "id"  [["entity_id", 1], ["event_type", "money_withdrawn"], ["data", "{\"amount\":500.0}"], ["created_at", "2024-12-02 15:05:58.262677"], ["updated_at", "2024-12-02 15:05:58.262677"]]
UPDATE "bank_accounts" SET "balance" = ?, "updated_at" = ? WHERE "bank_accounts"."id" = ?  [["balance", 8500.0], ["updated_at", "2024-12-02 15:05:58.263927"], ["id", 1]]
INSERT INTO "transactions" ("account_id", "transaction_type", "amount", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?) RETURNING "id"  [["account_id", 1], ["transaction_type", "withdrawal"], ["amount", 500.0], ["created_at", "2024-12-02 15:05:58.267074"], ["updated_at", "2024-12-02 15:05:58.267074"]]
---
  def execute
    account = Read::BankAccount.find_by(account_id: @account_id)
    raise 'Insufficient funds' if account.balance < @amount

    Event.create!(entity_id: @account_id, event_type: 'money_withdrawn', data: { amount: @amount })
    account.update!(balance: account.balance - @amount)

    Read::Transaction.create!(account_id: @account_id, transaction_type: 'withdrawal', amount: @amount)