app/queries/fetch_account_details_query.rb

SELECT "bank_accounts".* FROM "bank_accounts" WHERE "bank_accounts"."account_id" = ? LIMIT ?  [["account_id", 1], ["LIMIT", 1]]
---
  def execute
    account = Read::BankAccount.find_by(account_id: @account_id)